#include <iostream>
using namespace std;

int n;

// 길이는 1000, 선택할 수 있는 가지수는 3개
// dp -> 현재 i번째에서 T가 몇번 선택됐는가(2차원)
long long dp[1000][3][3];

void solve(){
    // 0번째 자리에서 T 선택 x -> 2가지 경우의 수
    // G 선택
    dp[0][0][0] = 1;
    // B 선택
    dp[0][0][1] = 1;
    // 0번째 자리에서 T 선택 -> 1가지 경우의 수
    dp[0][1][0] = 1;

    for(int i = 1; i<n; i++){
        
            // T 0개 B 연속 0개인 경우를 만들려면
            // T 0개 -> B 0개 1개 2개
            dp[i][0][0] = (dp[i-1][0][0] + dp[i-1][0][1] + dp[i-1][0][2]);
            // T 0개 B가 연속 1개인 경우를 만들려면
            // T 0개 B가 연속 0개인 경우
            dp[i][0][1] = (dp[i-1][0][0]);
            // T가 0개 B가 연속 2개인 경우를 만들려면
            // T가 0게 B가 연속 1개
            dp[i][0][2] = (dp[i-1][0][1]);
            // T 1개 B 연속 0게
            // T를 선택하는 경우
            // T를 선택 안 하는 경우
            dp[i][1][0] = (dp[i-1][0][0] + dp[i-1][0][1] + dp[i-1][0][2]
                            +dp[i-1][1][0] + dp[i-1][1][1] + dp[i-1][1][2]);
            dp[i][1][1] = (dp[i-1][1][0]);
            dp[i][1][2] = (dp[i-1][1][1]);
            // T2개 B 연속 0게
            dp[i][2][0] = (dp[i-1][1][0] + dp[i-1][1][1] + dp[i-1][1][2]
                            +dp[i-1][2][0] + dp[i-1][2][1] + dp[i-1][2][2]);
            dp[i][2][1] = (dp[i-1][2][0]);
            dp[i][2][2] = (dp[i-1][2][1]);

        for(int j = 0; j<3; j++){
            for(int k = 0; k<3; k++){
                dp[i][j][k] %= (1000000000+7);
            }
        }
    }
}

int main() {
    cin >> n;
    // Please write your code here.
    solve();

    long long ans = 0;
    for(int i = 0; i<3; i++){
        for(int j = 0; j<3; j++){
            ans += dp[n-1][i][j];
        }
    }

    ans = ans % (1000000000+7);
    cout << ans;
    return 0;
}
