#include <iostream>
#include <algorithm>
using namespace std;

int main() {
    int n;
    cin >> n;

    int coin[1001];

    for (int i = 1; i <= n; i++) {
        cin >> coin[i];
    }

    // dp[i][j] - i: i층 , j: i층에 오기 위해 1칸을 몇 번 썼는지, 0~3까지 가능. 최대 3칸 가능 . 
  
    int dp[1001][4];

    for (int i = 0; i <= n; i++) {
        for (int j = 0; j <= 3; j++) {
            dp[i][j] = -1;
        }
    }

    // 시작점
    dp[0][0] = 0;

    for (int i = 1; i <= n; i++) {
        for (int j = 0; j <= 3; j++) {

            // i-1층에서 1칸 올라오는 경우
            // 1칸 이동을 하나 사용하므로 이전에는 j-1번 사용
            if (i - 1 >= 0 && j - 1 >= 0 && dp[i - 1][j - 1] != -1) {
                dp[i][j] = max(dp[i][j],dp[i - 1][j - 1] + coin[i]);
            }

            // i-2층에서 2칸 올라오는 경우
            // 1칸 이동 횟수는 그대로 j번
            if (i - 2 >= 0 && dp[i - 2][j] != -1) {
                dp[i][j] = max(dp[i][j],dp[i - 2][j] + coin[i]);
            }

        }
    }

    int answer = 0;

    for (int j = 0; j <= 3; j++) {
        answer = max(answer, dp[n][j]); // n 층의 최대값 
    }

    cout << answer;

    return 0;
}

/*

    0 1 2 3 - 1칸을 몇 번 갔는지 (0은 2칸만 사용했을 때)
0   0 x x x    
1   x 1 x x
2   2 x 3 x
3   x 5 x 6
4   6 x 9 x

i층을 갈 건데, i-1에서 2칸은 불가능. 
i층을 가기 위해서 i-1에서 1칸 또는 i-2에서 2칸이어야함.

그래서 i위치에서 i-1는, 이전 층과 바로 한 칸의 사용 전인 i-1,j-1 를 살펴보고
i-2는, 2층 전을 쓰기 전과 한 칸은 안 늘어나니까 그대로인 i-2,j 를 살펴본다. 

*/

/*


                    1칸 이동 사용 횟수 j

                 0          1          2          3
             ┌────────┬────────┬────────┬────────┐
0층          │   0    │   X    │   X    │   X    │
             └────────┴────────┴────────┴────────┘
                 │         ╲
            +2칸 │          ╲ +1칸
                 │           ╲
                 │            ↓
             ┌────────┬────────┬────────┬────────┐
1층          │   X    │   1    │   X    │   X    │
             └────────┴────────┴────────┴────────┘
                 ↑          │          ╲
                 │          │ +2칸      ╲ +1칸
              +2칸          │            ╲
                 │          │             ↓
             ┌────────┬────────┬────────┬────────┐
2층          │   2    │   X    │   3    │   X    │
             └────────┴────────┴────────┴────────┘
                 │ ╲                   │ ╲
                 │  ╲                  │  ╲
             +2칸│   ╲+1칸         +2칸│   ╲+1칸
                 │    ╲                │    ╲
                 ↓     ↓               ↓     ↓
             ┌────────┬────────┬────────┬────────┐
3층          │   X    │   5    │   X    │   6    │
             └────────┴────────┴────────┴────────┘
                      │ ╲                   │
                      │  ╲                  │
                  +2칸│   ╲+1칸         +2칸│
                      │    ╲                  │
                      ↓     ↓                 ↓
             ┌────────┬────────┬────────┬────────┐
4층          │   6    │   X    │   9    │   X    │
             └────────┴────────┴────────┴────────┘

*/